Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_adc.cpp
  /* Configure ADC2_CFG register with new value */
  MDR_ADC->ADC2_CFG = tmpreg_CFG;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Selects the ADC1 Channel number for Single Channel Mode conversion.
  * @param  Channel: specifies the ADC Channel number.
  * @retval None
  */
void ADC1_SetChannel(uint32_t Channel)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC1_CH_NUM(Channel));

  tmpreg_CFG = MDR_ADC->ADC1_CFG;
  tmpreg_CFG &= ~ADC1_CFG_REG_CHS_Msk;
  tmpreg_CFG += Channel << ADC1_CFG_REG_CHS_Pos;
  MDR_ADC->ADC1_CFG = tmpreg_CFG;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Selects the ADC2 Channel number for Single Channel Mode conversion.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  Channel: specifies the ADC Channel number.
  * @retval None
  */
void ADC2_SetChannel(uint32_t Channel)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC2_CH_NUM(Channel));

  tmpreg_CFG = MDR_ADC->ADC2_CFG;
  tmpreg_CFG &= ~ADC2_CFG_REG_CHS_Msk;
  tmpreg_CFG += Channel << ADC2_CFG_REG_CHS_Pos;
  MDR_ADC->ADC2_CFG = tmpreg_CFG;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Selects the ADC1 Channels for conversion with Channels switching.
  * @param  ChannelMask: specifies the ADC Channels Mask.
  * @retval None
  */
void ADC1_SetChannels(uint32_t ChannelMask)
{
  /* Check the parameters */
  assert_param(IS_ADC1_CH_MASK(ChannelMask));

  MDR_ADC->ADC1_CHSEL = ChannelMask;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Selects the ADC2 Channels for conversion with Channels switching.
  * @param  ChannelMask: specifies the ADC Channels Mask.
  * @retval None
  */
void ADC2_SetChannels(uint32_t ChannelMask)
{
  /* Check the parameters */
  assert_param(IS_ADC2_CH_MASK(ChannelMask));

  MDR_ADC->ADC2_CHSEL = ChannelMask;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Sets the ADC1 operation mode.
  * @param  SamplingMode: specifies the ADC1 sampling.
  * @param  SwitchingMode: specifies the ADC1 channel switching.
  * @retval None
  */
void ADC1_OperationModeConfig(uint32_t SamplingMode, uint32_t SwitchingMode)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_SAMPLING_MODE_CONFIG(SamplingMode));
  assert_param(IS_ADC_CH_SWITCHING_CONFIG(SwitchingMode));

  tmpreg_CFG = MDR_ADC->ADC1_CFG;
  tmpreg_CFG &= ~(ADC1_CFG_REG_SAMPLE | ADC1_CFG_REG_CHCH);
  tmpreg_CFG += SamplingMode + SwitchingMode;
  MDR_ADC->ADC1_CFG = tmpreg_CFG;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Sets the ADC2 operation mode.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  SamplingMode: specifies the ADC2 sampling.
  * @param  SwitchingMode: specifies the ADC2 channel switching.
  * @retval None
  */
void ADC2_OperationModeConfig(uint32_t SamplingMode, uint32_t SwitchingMode)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_SAMPLING_MODE_CONFIG(SamplingMode));
  assert_param(IS_ADC_CH_SWITCHING_CONFIG(SwitchingMode));

  tmpreg_CFG = MDR_ADC->ADC2_CFG;
  tmpreg_CFG &= ~(ADC2_CFG_REG_SAMPLE | ADC2_CFG_REG_CHCH);
  tmpreg_CFG += SamplingMode + SwitchingMode;
  MDR_ADC->ADC2_CFG = tmpreg_CFG;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Sets the ADC1 sampling mode.
  * @param  SamplingMode: specifies the ADC1 sampling.
  * @retval None
  */
void ADC1_SamplingModeConfig(uint32_t SamplingMode)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_SAMPLING_MODE_CONFIG(SamplingMode));

  tmpreg_CFG = MDR_ADC->ADC1_CFG;
  tmpreg_CFG &= ~ADC1_CFG_REG_SAMPLE;
  tmpreg_CFG += SamplingMode;
  MDR_ADC->ADC1_CFG = tmpreg_CFG;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Sets the ADC2 sampling mode.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  SamplingMode: specifies the ADC2 sampling.
  * @retval None
  */
void ADC2_SamplingModeConfig(uint32_t SamplingMode)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_SAMPLING_MODE_CONFIG(SamplingMode));

  tmpreg_CFG = MDR_ADC->ADC2_CFG;
  tmpreg_CFG &= ~ADC2_CFG_REG_SAMPLE;
  tmpreg_CFG += SamplingMode;
  MDR_ADC->ADC2_CFG = tmpreg_CFG;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Sets the ADC1 channel switching mode.
  * @param  SwitchingMode: specifies the ADC1 channel switching.
  * @retval None
  */
void ADC1_ChannelSwitchingConfig(uint32_t SwitchingMode)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_CH_SWITCHING_CONFIG(SwitchingMode));

  tmpreg_CFG = MDR_ADC->ADC1_CFG;
  tmpreg_CFG &= ~ADC1_CFG_REG_CHCH;
  tmpreg_CFG += SwitchingMode;
  MDR_ADC->ADC1_CFG = tmpreg_CFG;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Sets the ADC2 channel switching mode.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  SwitchingMode: specifies the ADC2 channel switching.
  * @retval None
  */
void ADC2_ChannelSwitchingConfig(uint32_t SwitchingMode)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_CH_SWITCHING_CONFIG(SwitchingMode));

  tmpreg_CFG = MDR_ADC->ADC2_CFG;
  tmpreg_CFG &= ~ADC2_CFG_REG_CHCH;
  tmpreg_CFG += SwitchingMode;
  MDR_ADC->ADC2_CFG = tmpreg_CFG;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Configures the ADC1 threshould levels.
  * @param  LowLevel: specifies the ADC1 low level value.
  * @param  HighLevel: specifies the ADC1 high level value.
  * @param  NewState: enables or disables levels control.
  * @retval None
  */
void ADC1_LevelsConfig(uint32_t LowLevel, uint32_t HighLevel, uint32_t NewState)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_LEVEL_CONTROL_CONFIG(NewState));
  assert_param(IS_ADC_VALUE(LowLevel));
  assert_param(IS_ADC_VALUE(HighLevel));

  tmpreg_CFG = MDR_ADC->ADC1_CFG;
  tmpreg_CFG &= ~ADC1_CFG_REG_RNGC;
  tmpreg_CFG += NewState;
  MDR_ADC->ADC1_CFG = tmpreg_CFG;

  MDR_ADC->ADC1_L_LEVEL = LowLevel;
  MDR_ADC->ADC1_H_LEVEL = HighLevel;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Configures the ADC2 threshould levels.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  LowLevel: specifies the ADC2 low level value.
  * @param  HighLevel: specifies the ADC2 high level value.
  * @param  NewState: enables or disables levels control.
  * @retval None
  */
void ADC2_LevelsConfig(uint32_t LowLevel, uint32_t HighLevel, uint32_t NewState)
{
  uint32_t tmpreg_CFG;

  /* Check the parameters */
  assert_param(IS_ADC_LEVEL_CONTROL_CONFIG(NewState));
  assert_param(IS_ADC_VALUE(LowLevel));
  assert_param(IS_ADC_VALUE(HighLevel));

  tmpreg_CFG = MDR_ADC->ADC2_CFG;
  tmpreg_CFG &= ~ADC2_CFG_REG_RNGC;
  tmpreg_CFG += NewState;
  MDR_ADC->ADC2_CFG = tmpreg_CFG;

