Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_adc.cpp
  MDR_ADC->ADC2_L_LEVEL = LowLevel;
  MDR_ADC->ADC2_H_LEVEL = HighLevel;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Sets the ADC1 low level.
  * @param  LowLevel: specifies the ADC1 low level value.
  * @retval None
  */
void ADC1_SetLowLevel(uint32_t LowLevel)
{
  /* Check the parameters */
  assert_param(IS_ADC_VALUE(LowLevel));

  MDR_ADC->ADC1_L_LEVEL = LowLevel;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Sets the ADC2 low level.
  * @param  LowLevel: specifies the ADC2 low level value.
  * @retval None
  */
void ADC2_SetLowLevel(uint32_t LowLevel)
{
  /* Check the parameters */
  assert_param(IS_ADC_VALUE(LowLevel));

  MDR_ADC->ADC2_L_LEVEL = LowLevel;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Sets the ADC1 high level.
  * @param  HighLevel: specifies the ADC1 high level value.
  * @retval None
  */
void ADC1_SetHighLevel(uint32_t HighLevel)
{
  /* Check the parameters */
  assert_param(IS_ADC_VALUE(HighLevel));

  MDR_ADC->ADC1_H_LEVEL = HighLevel;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Sets the ADC2 high level.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  HighLevel: specifies the ADC2 high level value.
  * @retval None
  */
void ADC2_SetHighLevel(uint32_t HighLevel)
{
  /* Check the parameters */
  assert_param(IS_ADC_VALUE(HighLevel));

  MDR_ADC->ADC2_H_LEVEL = HighLevel;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Starts the ADC1 conversion.
  * @param  None.
  * @retval None.
  */
void ADC1_Start(void)
{
  MDR_ADC->ADC1_CFG |= ADC1_CFG_REG_GO;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Starts the ADC2 conversion.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  None.
  * @retval None.
  */
void ADC2_Start(void)
{
  MDR_ADC->ADC2_CFG |= ADC2_CFG_REG_GO;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Returns the ADC1 result.
  * @param  None.
  * @retval ADC1 Result Register value.
  */
uint32_t ADC1_GetResult(void)
{
  return MDR_ADC->ADC1_RESULT;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Returns the ADC2 result.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  None.
  * @retval ADC2 Result Register value.
  */
uint32_t ADC2_GetResult(void)
{
  return MDR_ADC->ADC2_RESULT;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Returns the ADC1, ADC2 Status Registers combined value.
  * @param  None.
  * @retval The ADC1_STATUS, ADC2_STATUS Registers combined value.
  */
uint32_t ADC_GetStatus ( void )
{
#if defined  (USE_MDR1986VE9x)|| defined (USE_MDR1901VC1T)		/* For Cortex M3 */
  return MDR_ADC->ADC1_STATUS + (MDR_ADC->ADC2_STATUS << 16);
#elif defined ( USE_MDR1986VE3 ) || defined (USE_MDR1986VE1T) 	/* For Cortex M1 */
  return MDR_ADC->ADC1_STATUS;
#endif
}

/**
  * @brief  Returns the ADC1 Status Register value.
  * @param  None.
  * @retval The ADC1_STATUS Register value.
  */
uint32_t ADC1_GetStatus(void)
{
  return MDR_ADC->ADC1_STATUS;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T) /* For Cortex M3 */
/**
  * @brief  Returns the ADC2 Status Register value.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  None.
  * @retval The ADC2_STATUS Register value.
  */
uint32_t ADC2_GetStatus(void)
{
  return MDR_ADC->ADC2_STATUS;
}
#endif // #ifdef USE_MDR1986VE9x /* For Cortex M3 */

/**
  * @brief  Checks whether the specified ADC1, ADC2 Status flag is set or not.
  * @param  Flag: specifies the flag to check.
  *         This parameter can be one of the following values:
  *           @arg ADC1_FLAG_OVERWRITE:         the previous ADC1 measured value was overwritten;
  *           @arg ADC1_FLAG_OUT_OF_RANGE:      the ADC1 measured value is out of range;
  *           @arg ADC1_FLAG_END_OF_CONVERSION: the ADC1 conversion finished;
  *           @arg ADC2_FLAG_OVERWRITE:         the previous ADC2 measured value was overwritten;
  *           @arg ADC2_FLAG_OUT_OF_RANGE:      the ADC2 measured value is out of range;
  *           @arg ADC2_FLAG_END_OF_CONVERSION: the ADC2 conversion finished.
  * @retval Current Status flag state (SET or RESET).
  */
FlagStatus ADC_GetFlagStatus(uint32_t Flag)
{
  FlagStatus bitstatus;

  /* Check the parameters */
  assert_param(IS_ADC_STATUS_FLAG(Flag));

  if ((ADC_GetStatus() & Flag) == 0)
  {
    bitstatus = RESET;
  }
  else
  {
    bitstatus = SET;
  }

  return bitstatus;
}

/**
  * @brief  Checks whether the specified ADC1 Status flag is set or not.
  * @param  Flag: specifies the flag to check.
  *         This parameter can be one of the following values:
  *           @arg ADCx_FLAG_OVERWRITE:         the previous ADC1 measured value was overwritten;
  *           @arg ADCx_FLAG_OUT_OF_RANGE:      the ADC1 measured value is out of range;
  *           @arg ADCx_FLAG_END_OF_CONVERSION: the ADC1 conversion finished.
  * @retval Current Status flag state (SET or RESET).
  */
FlagStatus ADC1_GetFlagStatus(uint32_t Flag)
{
  FlagStatus bitstatus;

  /* Check the parameters */
  assert_param(IS_ADCx_STATUS_FLAG(Flag));

  if ((MDR_ADC->ADC1_STATUS & Flag) == 0)
  {
    bitstatus = RESET;
  }
  else
  {
    bitstatus = SET;
  }

  return bitstatus;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Checks whether the specified ADC2 Status flag is set or not.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  Flag: specifies the flag to check.
  *         This parameter can be one of the following values:
  *           @arg ADCx_FLAG_OVERWRITE:         the previous ADC2 measured value was overwritten;
  *           @arg ADCx_FLAG_OUT_OF_RANGE:      the ADC2 measured value is out of range;
  *           @arg ADCx_FLAG_END_OF_CONVERSION: the ADC2 conversion finished.
  * @retval Current Status flag state (SET or RESET).
  */
FlagStatus ADC2_GetFlagStatus(uint32_t Flag)
{
  FlagStatus bitstatus;

  /* Check the parameters */
  assert_param(IS_ADCx_STATUS_FLAG(Flag));

  if ((MDR_ADC->ADC2_STATUS & Flag) == 0)
  {
    bitstatus = RESET;
  }
  else
  {
    bitstatus = SET;
  }

