Ebkosha/gr/system/StdPeriph_Driver/src/MDR32F9Qx_adc.cpp
  return bitstatus;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Clears the ADC1 Overwrite flag.
  * @param  None.
  * @retval None
  */
void ADC1_ClearOverwriteFlag(void)
{
  MDR_ADC->ADC1_STATUS &= ~ADCx_FLAG_OVERWRITE;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Clears the ADC2 Overwrite flag.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  None.
  * @retval None
  */
void ADC2_ClearOverwriteFlag(void)
{
  MDR_ADC->ADC2_STATUS &= ~ADCx_FLAG_OVERWRITE;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Clears the ADC1 AWOIFEN flag.
  * @param  None.
  * @retval None
  */
void ADC1_ClearOutOfRangeFlag(void)
{
  MDR_ADC->ADC1_STATUS &= ~ADCx_FLAG_OUT_OF_RANGE;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Clears the ADC2 AWOIFEN flag.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  None.
  * @retval None
  */
void ADC2_ClearOutOfRangeFlag(void)
{
  MDR_ADC->ADC2_STATUS &= ~ADCx_FLAG_OUT_OF_RANGE;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Enables or disables the ADC1, ADC2 interrupts.
  * @param  ADC_IT: specifies the ADC interrupts sources to be enabled or disabled.
  *         This parameter can be any combination of the following values:
  *           @arg ADC1_IT_OUT_OF_RANGE:        the ADC1 measured value is out of range;
  *           @arg ADC1_IT_END_OF_CONVERSION:   the ADC1 conversion finished;
  *           @arg ADC2_IT_OUT_OF_RANGE:        the ADC2 measured value is out of range;
  *           @arg ADC2_IT_END_OF_CONVERSION:   the ADC2 conversion finished.
  * @param  NewState: new state of the ADC interrupts.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_ITConfig(uint32_t ADC_IT, FunctionalState NewState)
{
  uint32_t tmpreg_ADC1_IE;
  uint32_t tmpreg_ADC_IT;
#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
  uint32_t tmpreg_ADC2_IE;
#endif

  /* Check the parameters */
  assert_param(IS_ADC_CONFIG_IT(ADC_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  tmpreg_ADC1_IE = MDR_ADC->ADC1_STATUS;
  tmpreg_ADC_IT = ADC_IT << 2;

  /* Form new value */
  if (NewState != DISABLE)
  {
    /* Enable the ADC Interrupt requests by setting bits in the ADCx_STATUS registers */
    tmpreg_ADC1_IE |= tmpreg_ADC_IT & 0xFFFF;
  }
  else
  {
    /* Disable the ADC Interrupt requests by clearing bits in the ADCx_STATUS registers */
    tmpreg_ADC1_IE &= ~(tmpreg_ADC_IT & 0xFFFF);
  }

  /* Configure ADCx_STATUS registers with new value */
  MDR_ADC->ADC1_STATUS = tmpreg_ADC1_IE;

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)

  tmpreg_ADC2_IE = MDR_ADC->ADC2_STATUS;

  /* Form new value */
  if (NewState != DISABLE)
  {
    /* Enable the ADC Interrupt requests by setting bits in the ADCx_STATUS registers */
    tmpreg_ADC2_IE |= tmpreg_ADC_IT >> 16;
  }
  else
  {
    /* Disable the ADC Interrupt requests by clearing bits in the ADCx_STATUS registers */
    tmpreg_ADC2_IE &= ~(tmpreg_ADC_IT >> 16);
  }
  /* Configure ADCx_STATUS registers with new value */
  MDR_ADC->ADC2_STATUS = tmpreg_ADC2_IE;
#endif /* #if defined  (USE_MDR1986VE9x) */
}

/**
  * @brief  Enables or disables the ADC1 interrupts.
  * @param  ADC_IT: specifies the ADC1 interrupts sources to be enabled or disabled.
  *         This parameter can be any combination of the following values:
  *           @arg ADC1_IT_OUT_OF_RANGE:        the ADC1 measured value is out of range;
  *           @arg ADC1_IT_END_OF_CONVERSION:   the ADC1 conversion finished.
  * @param  NewState: new state of the ADC1 interrupts.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC1_ITConfig(uint32_t ADC_IT, FunctionalState NewState)
{
  uint32_t tmpreg_ADC1_IE;

  /* Check the parameters */
  assert_param(IS_ADCx_CONFIG_IT(ADC_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  tmpreg_ADC1_IE = MDR_ADC->ADC1_STATUS;

  /* Form new value */
  if (NewState != DISABLE)
  {
    /* Enable the ADC Interrupt requests by setting bits in the ADC1_STATUS register */
    tmpreg_ADC1_IE |= (ADC_IT << 2);
  }
  else
  {
    /* Disable the ADC Interrupt requests by clearing bits in the ADC1_STATUS register */
    tmpreg_ADC1_IE &= ~(ADC_IT << 2);
  }

  /* Configure ADC1_STATUS registers with new value */
  MDR_ADC->ADC1_STATUS = tmpreg_ADC1_IE;
}

#if defined  (USE_MDR1986VE9x) || defined (USE_MDR1901VC1T)
/**
  * @brief  Enables or disables the ADC2 interrupts.
  * @warning 	This function can be used only for microcontroller
  * 		series MDR1986VE9x.
  * @param  ADC_IT: specifies the ADC2 interrupts sources to be enabled or disabled.
  *         This parameter can be any combination of the following values:
  *           @arg ADC2_IT_OUT_OF_RANGE:        the ADC2 measured value is out of range;
  *           @arg ADC2_IT_END_OF_CONVERSION:   the ADC2 conversion finished.
  * @param  NewState: new state of the ADC2 interrupts.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC2_ITConfig(uint32_t ADC_IT, FunctionalState NewState)
{
  uint32_t tmpreg_ADC2_IE;

  /* Check the parameters */
  assert_param(IS_ADCx_CONFIG_IT(ADC_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  tmpreg_ADC2_IE = MDR_ADC->ADC2_STATUS;

  /* Form new value */
  if (NewState != DISABLE)
  {
    /* Enable the ADC Interrupt requests by setting bits in the ADC2_STATUS register */
    tmpreg_ADC2_IE |= (ADC_IT << 2);
  }
  else
  {
    /* Disable the ADC Interrupt requests by clearing bits in the ADC2_STATUS register */
    tmpreg_ADC2_IE &= ~(ADC_IT << 2);
  }

  /* Configure ADC2_STATUS registers with new value */
  MDR_ADC->ADC2_STATUS = tmpreg_ADC2_IE;
}
#endif /* #if defined  (USE_MDR1986VE9x) */

/**
  * @brief  Checks whether the ADC1, ADC2 interrupt has occurred or not.
  * @param  ADC_IT: specifies the ADC interrupt source to check.
  *         This parameter can be one of the following values:
  *           @arg ADC1_IT_OUT_OF_RANGE:        the ADC1 measured value is out of range;
  *           @arg ADC1_IT_END_OF_CONVERSION:   the ADC1 conversion finished;
  *           @arg ADC2_IT_OUT_OF_RANGE:        the ADC2 measured value is out of range;
  *           @arg ADC2_IT_END_OF_CONVERSION:   the ADC2 conversion finished.
  * @retval The new state of the ADC_IT (SET or RESET).
  */
ITStatus ADC_GetITStatus(uint32_t ADC_IT)
{
  ITStatus bitstatus;
  uint32_t tmpreg;

  /* Check the parameters */
  assert_param(IS_ADC_CONFIG_IT(ADC_IT));

  tmpreg = ADC_GetStatus();
  tmpreg &= (tmpreg >> 2) & ADC_IT;

